Revit 2026 API

# SubTransaction Properties

---

The SubTransaction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

SubTransaction Class

Autodesk.Revit.DB Namespace